ergasia5/ergasia5soap/src/main/resources/requestGetAccountInfo.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:depositAmountRequest>
            <gs:customerName>Customer 2</gs:customerName>
        </gs:depositAmountRequest>
    </soapenv:Body>
</soapenv:Envelope>